package fibonacci;

public class RecursiveFibonacci {
    /**
     * Просторова та часова складність:
     * Буде O(n^2) - оскільки на кожному рівні потрібно зберігати
     * та обчислювати значення попердніх чисел фібоначі. Економно
     * по памяті, оскільки не використовуємо зайвих змінних, проте
     * такий підхід не зовсім ефективний, оскільки при великому n,
     * кількість викликів рекурсії настільки велика, що було б корисним
     * зберігати числа на деяких рівнях.
     */
    public static long fibonacci(int n){
        if(n <= 1) return n;

        return fibonacci(n - 1) + fibonacci(n - 2);
    }
}
